# Packages to be installed on all installations

# --- System packages --- 

# Kernel and headers
linux
linux-headers

# All the base packages required by Arch
base

# Packages required for building/compiling new packages
base-devel


# --- Terminal tools ---

# Terminal emulator
alacritty

# Shell
zsh

# Version control
git

# A "better" directory lister
exa

# Fuzzy finder
fzf

# Faster version of grep
ripgrep

# SSH
openssh

# Activity monitor
htop


# --- GUI ---

# Window server
xorg
xorg-server

# Xorg init tool (startx)
xorg-init

# Keybindings
xbindkeys

# Tiling window manager
i3-gaps

# Program launcher
dmenu

# Image viewer
feh


# --- Developer tools ---

# Newest version of python3
python3

# Python3 package manager
python-pip

# Rust
rust
rustup

# Nodejs
nodejs

# Node package manager
npm

# Database
postgresql


# --- Desktop applications ---

# Web browser
firefox
