tap 'homebrew/cask-fonts'

brew 'docker-compose'
brew 'exa'
brew 'fnm'
brew 'htop'
brew 'lazygit'
brew 'neovim'
brew 'pyenv'
brew 'ripgrep'
brew 'rustup-init'
brew 'tmux'
brew 'wget'
brew 'zplug'

cask 'alacritty'
cask 'alfred'
cask 'docker'
cask 'firefox'
cask 'font-hack-nerd-font'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
